{
  "@metadata": {
    "authors": [
      "Leonardo Fagundes de Castro"
    ],
    "locale": "en"
  },
  "resume": "Résumé",
  "introduction_header": "Developer offering frontend and backend services. See below for more details about my profile.",
  "summary": "Summary",
  "summary_text_1": "Highly skilled and proficient in various aspects of web development, I possess a strong command of the ",
  "summary_text_2": "language and excel in ",
  "summary_text_3": " With a solid foundation in these technologies, I have consistently delivered high-quality solutions and contributed to the successful development of numerous projects.\nMy extensive knowledge and expertise in these areas allow me to effectively design, develop, and implement engaging and user-friendly web applications.",
  "summary_text_4": " Additionally, my strong ",
  "summary_text_5": "abilities and attention to detail enable me to tackle complex challenges and deliver efficient solutions.",
  "summary_text_6": " With a passion for staying up to date with the latest industry trends, I consistently strive to enhance my skills and ensure that my work remains innovative and cutting-edge.\nThrough my commitment to excellence and a proven track record of success, I am well-equipped to contribute to any team or project that requires expertise in ",
  "and": " and",
  "english": "English",
  "frontend_text": "Creating elegant frontend responsive interfaces to provide the best UX for the users.",
  "backend_text": "Developing efficient APIs to provide processed data to the frontend and to other applications",
  "languages_text": "Ability to speak fluently more then one language, to be able to communicate with the team.",
  "languages_i_speak": "Languages that I speak",
  "portuguese_level": "Portuguese - Native",
  "english_level": "English - Fluent",
  "spanish_level": "Spanish - Basis",
  "relevant_companies_text": "Relevant Companies that I've worked for",
  "activities": "Activities",
  "companio_activity_1": "Developed new features and enhancements in both frontend and backend using JavaScript as the primary programming language.",
  "companio_activity_2": "Conducted source code analysis to identify and correct the root causes of issues.",
  "companio_activity_3": "Participated in weekly video meetings with a multicultural and multilingual development team to align on project needs, improvements, and tasks.",
  "companio_activity_4": "Hosted Knowledge Sharing sessions for all company employees to promote learning and knowledge exchange.",
  "companio_activity_5": "Took initiative to dive into new projects aimed at enhancing the company's system.",
  "companio_activity_6": "Utilized Git as the version control system and GitHub as remote repositories for efficient code management.",
  "companio_activity_7": "Developed new features using React.js and Redux for frontend development.",
  "companio_activity_8": "Integrated third-party applications with company APIs to improve system functionality and connectivity.",
  "tsc_activity_1": "Actively analyze source code to identify the root causes of problems and implement necessary corrections.",
  "tcs_activity_2": "Provide user support for systems, including ADM Origination (Client ERP) and JDE Oracle, with a focus on the Distribution, Accountancy, and Financial modules.",
  "tcs_activity_3": "Deliver comprehensive training to new team members and devise strategies for process optimization.",
  "tcs_activity_4": "Create detailed Procedure Operation Process (POP) manuals for seamless system operations.",
  "tcs_activity_5": "Generate reports using Microsoft SQL Server and Toad (Oracle) to support audits and drive business activities.",
  "tcs_activity_6": "Collaborate closely with fiscal and accounting teams during monthly closing to ensure compliance with regulatory requirements.",
  "tcs_activity_7": "Demonstrate expertise in problem-solving and bug resolution for the company's web systems.",
  "thank_you": "Thank you for visiting my Portfolio",
  "contact": "These are my contacts:"
}