{
  "@metadata": {
    "authors": [
      "Leonardo Fagundes de Castro"
    ],
    "locale": "pt"
  },
  "resume": "Curriculo",
  "introduction_header": "Desenvolvedor oferecendo serviços de frontend e backend. Veja abaixo mais detalhes sobre meu perfil.",
  "summary": "Resumo",
  "summary_text_1": "Altamente habilidoso e proficiente em diversos aspectos do desenvolvimento web, possuo um forte domínio da língua ",
  "summary_text_2": "e me destaco em ",
  "summary_text_3": " Com uma base sólida nessas tecnologias, tenho consistentemente entregado soluções de alta qualidade e contribuído para o desenvolvimento bem-sucedido de inúmeros projetos.\nMeu amplo conhecimento e expertise nessas áreas me permitem projetar, desenvolver e implementar aplicativos web envolventes e amigáveis ao usuário de forma eficaz.",
  "summary_text_4": " Além disso, minha habilidade em ",
  "summary_text_5": "e minha atenção aos detalhes me capacitam a enfrentar desafios complexos e entregar soluções eficientes.",
  "summary_text_6": " Com paixão por estar atualizado com as últimas tendências do setor, eu sempre me esforço para aprimorar minhas habilidades e garantir que meu trabalho permaneça inovador e de ponta.\nPor meio do meu compromisso com a excelência e um histórico comprovado de sucesso, estou bem preparado para contribuir com qualquer equipe ou projeto que exija expertise na lingua ",
  "and": " e",
  "english": "inglesa",
  "frontend_text": "Criando interfaces front-end elegantes e responsivas para oferecer a melhor experiência do usuário (UX) para os usuários.",
  "backend_text": "Desenvolvendo APIs eficientes para fornecer dados processados para o frontend e para outras aplicações.",
  "languages_text": "Capacidade de falar fluentemente mais de um idioma, a fim de poder se comunicar com a equipe.",
  "languages_i_speak": "Linguagens que tenho proficiência",
  "portuguese_level": "Português - Nativo",
  "english_level": "Inglês - Fluente",
  "spanish_level": "Espanhol - Basico",
  "relevant_companies_text": "Empresas relevantes para quais já trabalhei",
  "activities": "Atividades",
  "companio_activity_1": "Desenvolvimento de novos recursos e aprimoramentos no frontend e backend com JavaScript como linguagem de código.",
  "companio_activity_2": "Atuação na leitura do código-fonte para identificar a causa raiz do problema e corrigi-los",
  "companio_activity_3": "Reunião semanal por vídeo com a equipe de desenvolvimento, que é multicultural e multilíngue, para alinhar todas as necessidades da equipe e o que devemos fazer e melhorar.",
  "companio_activity_4": "Realização de sessões de compartilhamento de conhecimento para todos os funcionários da empresa",
  "companio_activity_5": "Envolvimento em novos projetos para aprimorar o sistema da empresa.",
  "companio_activity_6": "Trabalho com o Git como controlador de versão e o GitHub como repositórios remotos",
  "companio_activity_7": "Desenvolver novos recursos utilizando React.js e Redux para o desenvolvimento front-end.",
  "companio_activity_8": "Integração aplicativos de terceiros com as APIs da empresa para melhorar a funcionalidade e conectividade do sistema.",
  "tsc_activity_1": "Analisar ativamente o código-fonte para identificar as causas raiz dos problemas e implementar as correções necessárias.",
  "tcs_activity_2": "Fornecer suporte aos usuários de sistemas, incluindo ADM Origination (ERP do Cliente) e JDE Oracle, com foco nos módulos de Distribuição, Contabilidade e Financeiro.",
  "tcs_activity_3": "Realizar treinamento abrangente para novos membros da equipe e elaborar estratégias de otimização de processos.",
  "tcs_activity_4": "Criar manuais detalhados de Procedimentos Operacionais (POP) para operações perfeitas do sistema.",
  "tcs_activity_5": "Gerar relatórios utilizando o Microsoft SQL Server e o Toad (Oracle) para suportar auditorias e impulsionar atividades empresariais.",
  "tcs_activity_6": "Colaborar de perto com as equipes fiscal e contábil durante o fechamento mensal para garantir conformidade com requisitos regulatórios.",
  "tcs_activity_7": "Demonstrar expertise na resolução de problemas e correção de bugs para os sistemas web da empresa.",
  "thank_you": "Obrigado por visitar o meu portfólio.",
  "contact": "Meus contatos abaixo:"
}